---
kind: type
id: T:Autodesk.Revit.DB.PropOverrideMode
source: html/8d32fcba-032e-fd21-2b94-f115733fcbaa.htm
---
# Autodesk.Revit.DB.PropOverrideMode

An enumerated type listing ways how overridden object styles get exported.

## Syntax (C#)
```csharp
public enum PropOverrideMode
```